app/views/users/show.html.erb

SELECT `uploads`.* FROM `uploads` WHERE (`uploads`.user_id = 1)
---
</p>
<h3 id="photos_count"><%= pluralize(@user.uploads.size, "Photo")%></h3>