app/controllers/uploads_controller.rb

  def show
    @upload = Upload.find(params[:id], :include => :user)
---
SELECT `uploads`.* FROM `uploads` WHERE (`uploads`.`id` = 20) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3)

  def create
      newparams = coerce(params)
      @upload = Upload.new(newparams[:upload])
      if @upload.save
---
INSERT INTO `uploads` (`created_at`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `updated_at`, `user_id`) VALUES ('2010-09-17 03:53:56', 'image/jpeg', 'DSC00034.JPG', 2850816, '2010-09-17 03:53:56', '2010-09-17 03:53:56', 1)