app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = User.all

SELECT `uploads`.* FROM `uploads` WHERE (`uploads`.user_id = 1)
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id], :include => :uploads)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`created_at`, `name`, `updated_at`) VALUES ('2010-09-17 03:52:17', 'Amit', '2010-09-17 03:52:17')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE (`users`.`id` = 1)
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy